--
-- PostgreSQL database dump
--

-- Dumped from database version 14.11 (Homebrew)
-- Dumped by pg_dump version 14.11 (Homebrew)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: action_text_rich_texts; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.action_text_rich_texts (
    id bigint NOT NULL,
    name character varying NOT NULL,
    body text,
    record_type character varying NOT NULL,
    record_id bigint NOT NULL,
    created_at timestamp(6) without time zone NOT NULL,
    updated_at timestamp(6) without time zone NOT NULL
);


ALTER TABLE public.action_text_rich_texts OWNER TO lvguanlin;

--
-- Name: action_text_rich_texts_id_seq; Type: SEQUENCE; Schema: public; Owner: lvguanlin
--

CREATE SEQUENCE public.action_text_rich_texts_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.action_text_rich_texts_id_seq OWNER TO lvguanlin;

--
-- Name: action_text_rich_texts_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: lvguanlin
--

ALTER SEQUENCE public.action_text_rich_texts_id_seq OWNED BY public.action_text_rich_texts.id;


--
-- Name: active_storage_attachments; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.active_storage_attachments (
    id bigint NOT NULL,
    name character varying NOT NULL,
    record_type character varying NOT NULL,
    record_id bigint NOT NULL,
    blob_id bigint NOT NULL,
    created_at timestamp(6) without time zone NOT NULL
);


ALTER TABLE public.active_storage_attachments OWNER TO lvguanlin;

--
-- Name: active_storage_attachments_id_seq; Type: SEQUENCE; Schema: public; Owner: lvguanlin
--

CREATE SEQUENCE public.active_storage_attachments_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.active_storage_attachments_id_seq OWNER TO lvguanlin;

--
-- Name: active_storage_attachments_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: lvguanlin
--

ALTER SEQUENCE public.active_storage_attachments_id_seq OWNED BY public.active_storage_attachments.id;


--
-- Name: active_storage_blobs; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.active_storage_blobs (
    id bigint NOT NULL,
    key character varying NOT NULL,
    filename character varying NOT NULL,
    content_type character varying,
    metadata text,
    service_name character varying NOT NULL,
    byte_size bigint NOT NULL,
    checksum character varying,
    created_at timestamp(6) without time zone NOT NULL
);


ALTER TABLE public.active_storage_blobs OWNER TO lvguanlin;

--
-- Name: active_storage_blobs_id_seq; Type: SEQUENCE; Schema: public; Owner: lvguanlin
--

CREATE SEQUENCE public.active_storage_blobs_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.active_storage_blobs_id_seq OWNER TO lvguanlin;

--
-- Name: active_storage_blobs_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: lvguanlin
--

ALTER SEQUENCE public.active_storage_blobs_id_seq OWNED BY public.active_storage_blobs.id;


--
-- Name: active_storage_variant_records; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.active_storage_variant_records (
    id bigint NOT NULL,
    blob_id bigint NOT NULL,
    variation_digest character varying NOT NULL
);


ALTER TABLE public.active_storage_variant_records OWNER TO lvguanlin;

--
-- Name: active_storage_variant_records_id_seq; Type: SEQUENCE; Schema: public; Owner: lvguanlin
--

CREATE SEQUENCE public.active_storage_variant_records_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.active_storage_variant_records_id_seq OWNER TO lvguanlin;

--
-- Name: active_storage_variant_records_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: lvguanlin
--

ALTER SEQUENCE public.active_storage_variant_records_id_seq OWNED BY public.active_storage_variant_records.id;


--
-- Name: ar_internal_metadata; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.ar_internal_metadata (
    key character varying NOT NULL,
    value character varying,
    created_at timestamp(6) without time zone NOT NULL,
    updated_at timestamp(6) without time zone NOT NULL
);


ALTER TABLE public.ar_internal_metadata OWNER TO lvguanlin;

--
-- Name: schema_migrations; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.schema_migrations (
    version character varying NOT NULL
);


ALTER TABLE public.schema_migrations OWNER TO lvguanlin;

--
-- Name: users; Type: TABLE; Schema: public; Owner: lvguanlin
--

CREATE TABLE public.users (
    id bigint NOT NULL,
    name character varying NOT NULL,
    gender integer NOT NULL,
    solar_birthday timestamp(6) without time zone,
    lunar_birthday timestamp(6) without time zone,
    year_gan character varying,
    year_zhi character varying,
    month_gan character varying,
    month_zhi character varying,
    day_gan character varying,
    day_zhi character varying,
    time_gan character varying,
    time_zhi character varying,
    qiyun character varying,
    dayun character varying[],
    liunian character varying[],
    liunian_first_age integer,
    xunkong character varying,
    qiangruo character varying,
    xishen character varying,
    jishen character varying,
    xianshen character varying,
    notes text,
    created_at timestamp(6) without time zone NOT NULL,
    updated_at timestamp(6) without time zone NOT NULL,
    relationship jsonb,
    feature text
);


ALTER TABLE public.users OWNER TO lvguanlin;

--
-- Name: users_id_seq; Type: SEQUENCE; Schema: public; Owner: lvguanlin
--

CREATE SEQUENCE public.users_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.users_id_seq OWNER TO lvguanlin;

--
-- Name: users_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: lvguanlin
--

ALTER SEQUENCE public.users_id_seq OWNED BY public.users.id;


--
-- Name: action_text_rich_texts id; Type: DEFAULT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.action_text_rich_texts ALTER COLUMN id SET DEFAULT nextval('public.action_text_rich_texts_id_seq'::regclass);


--
-- Name: active_storage_attachments id; Type: DEFAULT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_attachments ALTER COLUMN id SET DEFAULT nextval('public.active_storage_attachments_id_seq'::regclass);


--
-- Name: active_storage_blobs id; Type: DEFAULT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_blobs ALTER COLUMN id SET DEFAULT nextval('public.active_storage_blobs_id_seq'::regclass);


--
-- Name: active_storage_variant_records id; Type: DEFAULT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_variant_records ALTER COLUMN id SET DEFAULT nextval('public.active_storage_variant_records_id_seq'::regclass);


--
-- Name: users id; Type: DEFAULT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.users ALTER COLUMN id SET DEFAULT nextval('public.users_id_seq'::regclass);


--
-- Data for Name: action_text_rich_texts; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.action_text_rich_texts (id, name, body, record_type, record_id, created_at, updated_at) FROM stdin;
\.


--
-- Data for Name: active_storage_attachments; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.active_storage_attachments (id, name, record_type, record_id, blob_id, created_at) FROM stdin;
\.


--
-- Data for Name: active_storage_blobs; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.active_storage_blobs (id, key, filename, content_type, metadata, service_name, byte_size, checksum, created_at) FROM stdin;
\.


--
-- Data for Name: active_storage_variant_records; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.active_storage_variant_records (id, blob_id, variation_digest) FROM stdin;
\.


--
-- Data for Name: ar_internal_metadata; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.ar_internal_metadata (key, value, created_at, updated_at) FROM stdin;
environment	development	2023-04-06 13:33:23.887121	2023-04-06 13:33:23.887121
\.


--
-- Data for Name: schema_migrations; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.schema_migrations (version) FROM stdin;
20230324131633
20230506201429
20230511142359
20230511142360
20230808035758
\.


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: lvguanlin
--

COPY public.users (id, name, gender, solar_birthday, lunar_birthday, year_gan, year_zhi, month_gan, month_zhi, day_gan, day_zhi, time_gan, time_zhi, qiyun, dayun, liunian, liunian_first_age, xunkong, qiangruo, xishen, jishen, xianshen, notes, created_at, updated_at, relationship, feature) FROM stdin;
70	PTT-alexander112(已捐)	1	1989-11-10 06:56:00	1989-10-13 06:56:00	己	巳	乙	亥	甲	戌	丁	卯	0,10,0	{甲戌,癸酉,壬申,辛未,庚午,己巳,戊辰,丁卯}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥申酉	身強	金土火	木水		<div>問題：姻緣（未婚）<br><br><br><br>- 雖喜好交友及參加社交活動，但常常感覺到與朋友之間彼此的付出不成比例而有孤獨之感，知交好友不多，也容易遭到朋友的背叛或利用，需慎重交友<br>- 容易出現因業績或收入的分配而與同事或合夥人產生不愉快，在工作上需要小心，亦不適合與人合夥<br>- 在自我約束力上比較弱，會比較重視享受跟玩樂，因此容易與父母在這點上起衝突而產生爭執<br>- 在與朋友及兩性相處上，有時讓人感覺有雙重性格，會有說話矛盾反覆，或是言行不一的情況，容易讓人無所適從<br>- 在感情上不順遂，比較容易有競爭對手出現<br>- 今年已有對象出現但姻緣不顯，明年夫妻宮動，有結婚的跡象</div>	2023-08-29 13:24:36.38424	2024-01-18 13:48:22.98024	\N	
72	PTT-skyycat(已捐)	0	1989-12-29 06:43:00	1989-12-02 06:43:00	己	巳	丙	子	癸	亥	乙	卯	2,6,20	{丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥子丑	身弱	金水	木火土		<div>問題：工作的方向（未婚）<br><br><br><a href="http://localhost:3010/users/72">PTT-skyycat</a><br>- 做事較為衝動，想到什麼就直接行動，較少考量到後果，<br>- 事業上有才華，但常有有志難伸之感，雖有許多理想，卻較缺乏執行力而無法達成。前兩年運勢平順，今年轉差，而產生因表現不佳影響到收入的情況。明年此情況會有所改善。</div>	2023-09-04 13:56:12.36544	2024-01-18 13:49:05.098714	\N	
86	學富	1	1965-01-03 20:30:00	1964-12-01 20:30:00	甲	辰	丙	子	丁	巳	庚	戌	0,8,10	{丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申}	{甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯}	1	寅卯子丑	\N	\N	\N	\N	\N	2023-10-20 13:31:12.923992	2023-10-20 13:31:12.923992	\N	\N
49	徐語絹	0	1953-03-12 23:30:00	1953-01-27 23:30:00	癸	巳	乙	卯	壬	戌	壬	子	7,10,0	{丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥}	{癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰}	1	午未子丑	身弱	金	木火土	水		2023-07-07 15:26:19.975751	2023-07-07 15:40:51.873914	\N	\N
73	PTT-h3233s(已捐)	1	1984-07-09 13:30:00	1984-06-11 13:30:00	甲	子	辛	未	甲	辰	辛	未	9,8,10	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯}	{甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥}	1	戌亥寅卯	身弱	火木水	土金		<div>問題：在目前工作子公司轉為母公司正職人員的時間為何（未婚）<br><br><br><a href="http://localhost:3010/users/73">PTT-h3233s</a><br>在事業上你一直以來較缺乏決斷力，遇事容易猶豫不決，上司帶給你的壓力大，也較難獲得賞識，公司中競爭亦較激烈。今年8月後大運開始轉好，上述的狀況會有所改善，但原本今年有機會可以轉母公司，卻因同事之間的競爭而影響到此次的機會。明年的流年還可以，不過不會有能夠升職的機會。需等到2025 26年，流年亦轉好，你的才華能夠有所發揮，就有可能轉為母公司正職人員。</div>	2023-09-04 13:57:45.440591	2024-01-18 13:49:38.601835	\N	
47	王清源	1	1952-05-20 13:30:00	1952-04-27 13:30:00	壬	辰	乙	巳	丙	寅	乙	未	5,6,0	{丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑}	{壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯}	1	午未戌亥	\N	\N	\N	\N	\N	2023-07-07 15:24:11.100694	2023-07-07 15:24:11.100694	\N	\N
23	小鳳阿姨	0	1968-12-10 01:30:00	1968-10-21 01:30:00	戊	申	甲	子	甲	寅	乙	丑	0,10,20	{癸亥,壬戌,辛酉,庚申,己未,戊午,丁巳,丙辰}	{戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未}	1	寅卯子丑	身強	火金土	木水		<div>職業廟婆<br>33歲申子辰 乙庚和 離婚&nbsp;</div>	2023-06-02 14:08:20.085339	2023-06-02 15:31:59.424417	\N	\N
76	PTT-OrekiHotaro(已捐)	1	1998-03-09 17:30:00	1998-02-11 17:30:00	戊	寅	乙	卯	乙	卯	乙	酉	8,10,10	{丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥}	{戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑}	1	申酉子丑	身強	火金土	木水		<div>問題：您好，最近剛好遇到兩年前心儀的女生，之前因為某些原因沒有和她告白，這次成功與她約出來吃飯後感覺還不錯，想請問自己在愛情方面的運勢如何，感謝您！（未婚）<br><br><br>PTT-OrekiHotaro<br>- 做事較為衝動，想到什麼就直接行動，較少考量到後果，應三思而後行。<br>- 一直以來身邊姻緣較薄，就算出現也容易會有競爭對手而被奪。今明兩年您夫妻宮動，姻緣會較顯，有合意的對象可以適時把握，但仍然會有出現前述相同的情況，把握之餘亦需要多加注意。</div>	2023-09-13 01:16:33.803436	2024-01-18 13:50:58.096511	\N	
123	PTT-chuing	0	1993-03-10 10:54:00	1993-02-18 10:54:00	癸	酉	乙	卯	庚	寅	辛	巳	8,6,20	{丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥午未					<div>問題：工作職涯（未婚）<br>- 此命局口才佳，適合業務類型的工作，但近年由於運勢影響，才華難以發揮，表達上較不如意，因此可以朝向較需要體力的工作類型尋找。另性喜兼業創業，但近年較不適合，亦不適合投資，宜專注於本業。<br>- 此命局容易衝動做錯誤決定，宜多親近宗教，尤其是文昌帝君，可穩定心緒增進智慧。<br>- 命局有在家中需承擔較多責任之傾向，量力而為可避免壓力過大。<br>- 人難免有因果，可嘗試去新莊大眾爺廟處理。</div>	2024-05-30 13:09:16.838415	2024-06-03 13:51:56.176324	\N	
8	游先生	1	1995-01-02 08:00:00	1994-12-02 08:00:00	甲	戌	丙	子	癸	巳	丙	辰	1,3,10	{丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申}	{甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉}	1	申酉午未	身弱				<div>35歲 申子辰 巳申&nbsp; 可能升官跟結婚<br>辰旭沖 可能有官司是非小人 跟祖輩或父母有關的問題<br>巳申和掉忌神化為水＝比間的力量<br>辛金和掉兩個正財，但火被和掉太多反而缺調候<br>本命辰旭沖 祖輩供緣份淺<br>卯旭和 祭神和祭神 為好<br>水火交戰 會一直想追求金錢或女生</div>	2023-05-06 18:19:46.093754	2023-05-21 01:48:29.950359	\N	\N
77	PTT-dogora(已捐)	0	1988-10-29 03:38:00	1988-09-19 03:38:00	戊	辰	壬	戌	丁	巳	壬	寅	6,11,0	{辛酉,庚申,己未,戊午,丁巳,丙辰,乙卯,甲寅}	{戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯}	1	戌亥子丑	身弱	金木火	土水		<div>問題：職涯發展議題及時機點：本身於公益團體服務性別暴力的被害人，但近期工作感到負荷壓力與倦怠，亦已屆35歲，故開始思考職涯發展與進修與否。 1.是維持原職位、2.調轉部門從事政策倡議工作（偏間接服務）、3.更換工作領域（如兒少）、4.進修研究所。 亦想瞭解有無較佳之時機點，謝謝！（未婚）<br><br><br>- 您的命局屬於喜歡在工作上求表現，與人接觸相處的工作，因此調轉到間接服務人群的部門會比較不適合。<br>- 工作上易產生桃花而造成壓力，這點就算調轉其他部門或轉換跑道都也還是很容易遇到相同狀況。<br>- 今年會感覺到在工作上難以發揮而產生倦怠感的情況，明年倦怠感上會有所改善，因此建議維持目前的工作即可，不過明年反而要小心過度的表現造成反效果，而內心不平衡。<br>- 若是更換領域到兒少相關，此命局雖喜歡小孩但與小孩緣份較薄，因此會產生小孩對於您的輔導較不容易接受的情況。<br>- 近幾年的運勢上不適合讀書，宜專注在工作上，等過了2025年之後就會比較順利。<br>- 明年宜力求避免與人的衝突，以減少產生官非的可能<br><br></div>	2023-09-19 07:39:57.44615	2024-01-18 13:51:44.145105	\N	
20	蔡凱強	1	1968-01-11 04:10:00	1967-12-12 04:10:00	丁	未	癸	丑	庚	辰	戊	寅	1,6,10	{壬子,辛亥,庚戌,己酉,戊申,丁未,丙午,乙巳}	{丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午}	1	寅卯申酉		火木水	土金			2023-05-25 14:35:20.655811	2023-05-26 13:17:43.774982	\N	\N
25	PTT-freedommoney(已捐)	0	1987-02-15 04:30:00	1987-01-18 04:30:00	丁	卯	壬	寅	乙	未	戊	寅	6,5,0	{癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥辰巳	身強	火金土	木水		<div><br><br>個性上的特點：<br>- 外表上好相處，是朋友認證的好好先生/小姐。<br>- 雖然會一直希望與上司的關係能夠打好，但是對於上司師長的管教命令比較會有對抗的想法，而產生矛盾的情況，若能放下抗上之心會比較容易得上司長輩喜愛<br>- 表面上給人比較小氣會計較的印象，實際上是屬於對自己會比較大方的類型<br>- 做事有時候會比較情緒化跟反覆不定，表裡不一及反差較大，會讓人無所適從，需要注意<br>- 交友雖廣但難得知己，也容易遭到朋友的背叛或利用，人情包袱重，需慎重交友<br>- 缺乏自制力，最好能靠另一半來約束自己<br><br>事業上：<br>- 正式工作以外自己會想要發展副業，可以朝向珠寶精品 金融 交通 家電 水電相關產業發展，但是會副業會勞多穫少，精力還是需放在正業為主<br>- 屬於精力旺盛比較靜不下來的人，自己也比較沒耐心，適合從事需要勞動的工作，若非的話需要靠多運動來發洩精力<br><br>感情：<br>- 另一半需要靠自己去主動追求<br>- 另一半在條件上會較好，屬於對人大方，不拘小節的人<br>- 因對於自身的約束力本就較差，對另一半的管教約束若能多聽從，感情會能夠比較融洽<br><br>身體上：<br>- 牙齒及骨骼 肺 甲狀腺呼吸道先天上較弱<br>- 脾胃消化系統較容易出問題<br><br>流年：<br>- 今年要注意容易因表現不當影響到事業<br>- 近兩年開銷較大，盡量避免借人錢或事業上與人合夥</div>	2023-06-03 18:11:53.704799	2024-01-18 13:32:21.01278	\N	
78	PTT-lalabu(已捐)	0	1993-01-13 20:00:00	1992-12-21 20:00:00	壬	申	癸	丑	甲	午	甲	戌	2,8,20	{壬子,辛亥,庚戌,己酉,戊申,丁未,丙午,乙巳}	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未}	1	戌亥辰巳	身弱	木水	土金丁火	丙火	<div>問題：找工作有什麼建議（未婚）<br><br><br>lalabu<br>- 好交朋友且慷慨大方，知己亦不少，尤其在事業上能獲得不少朋友的助力。<br>- 會想要斜槓經營副業，但較不適合，容易勞多穫少，建議盡量專注在本業即可。<br>- 因你的大運較差，目前在找工作上會比較不順，可以把握今年的農曆10,11月，但建議盡量不要找偏業，因您明年流年轉差，若從事偏業的工作，會容易出大問題<br>- 此命局較不適合投資，尤其明年更忌</div>	2023-09-27 06:45:11.277021	2024-01-18 13:55:05.749845	\N	
3	呂冠霖	0	1994-04-24 21:30:00	1994-03-14 21:30:00	甲	戌	戊	辰	庚	辰	丁	亥	6,6,10	{丁卯,丙寅,乙丑,甲子,癸亥,壬戌,辛酉,庚申}	{甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉}	1	申酉申酉	身強	木火水	土金		<div>2013大學入學<br>2016/12摩瑪任職<br>2018/5摩瑪離職<br>2019/1中青任職<br>2020/5 中青被炒<br>2020/10 五倍上課<br>2021/4學習王任職</div>	2023-04-30 03:49:16.875914	2024-05-30 14:10:31.789389	\N	
52	PTT說命很差	0	1985-10-27 07:30:00	1985-09-14 07:30:00	乙	丑	丙	戌	己	亥	戊	辰	3,10,0	{丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午}	{乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	1	戌亥辰巳	身強	金木水	土火			2023-07-09 12:53:04.103402	2023-07-09 12:54:46.63511	\N	\N
22	蔡小弟2	1	2006-03-03 08:30:00	2006-02-04 08:30:00	丙	戌	庚	寅	辛	卯	壬	辰	0,11,0	{辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌}	{丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉}	1	午未午未	身弱	金土	木水	火	<div>喜官不喜殺</div>	2023-05-26 14:35:34.088354	2023-05-26 14:50:51.105334	\N	\N
19	蔡小弟	1	2005-02-27 09:58:00	2005-01-19 09:58:00	乙	酉	戊	寅	壬	午	乙	巳	7,9,10	{丁丑,丙子,乙亥,甲戌,癸酉,壬申,辛未,庚午}	{乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申}	1	午未申酉	\N	\N	\N	\N	\N	2023-05-25 14:20:07.8965	2023-05-25 14:20:07.8965	\N	\N
80	PTT-Beast1111(已捐)	1	1989-11-11 22:00:00	1989-10-14 22:00:00	己	巳	乙	亥	乙	亥	丁	亥	1,4,20	{甲戌,癸酉,壬申,辛未,庚午,己巳,戊辰,丁卯}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥申酉	身強	金土火	水木		<div>問題：工作上近期是否會有轉變及需要注意些什麼（已婚）<br><br><br>PTT-Beast1111<br>- 愛鑽牛角尖，且情緒起伏較大，有憂鬱之傾向。<br>- 雖好交友，但知己不多，且易遭到朋友的背叛，需慎重交友，尤其需要盡量避免與朋友有金錢上的往來<br>- 事業上多想法，但各方面表現上一直無法如預期上的發揮。今年工作在冬天時會出現異動，建議可以多接近宗教，或是可以從事有支薪的公益相關工作，將會對整個命局有所助益。</div>	2023-10-04 13:16:52.181537	2024-01-18 13:56:10.639762	\N	亥亥自刑 乙木飄
108	PTT-SS20(已捐)	1	1989-11-26 06:30:00	1989-10-29 06:30:00	己	巳	乙	亥	庚	寅	己	卯	6,2,0	{甲戌,癸酉,壬申,辛未,庚午,己巳,戊辰,丁卯}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥午未	身弱	火金土	木水		<div>問題：今年(2024)換工作是否合適(公司內部調動)，或向外發展會更好，謝謝。<br>PTT-SS20<br>此命局易與上司起衝突，導致上司不喜，因此在公司內部的調動會屬於明升暗降，新職位會是你所不擅長的工作內容，導致無法順利發揮表現，而同時影響到你的業外與正職收入，因此另覓工作也是一種選擇。<br>今年在事業及財務上多波折，心緒亦多起伏，宜多接近宗教，方可化解。<br>另因流年影響，今年會容易衝動行事，應三思而後行，做決定前可以先多跟前輩或長輩討教</div>	2024-01-27 17:16:45.1543	2024-01-28 14:25:29.737787	\N	
16	呂正祥	1	1960-03-19 12:00:00	1960-02-22 12:00:00	庚	子	己	卯	丙	午	甲	午	5,6,10	{庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥}	{庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥}	1	辰巳寅卯	\N	\N	\N	\N	\N	2023-05-19 15:36:05.787477	2023-05-19 15:36:05.787477	\N	\N
27	PTT-KATZEN(已捐)	0	1988-11-09 23:30:00	1988-10-01 23:30:00	戊	辰	癸	亥	戊	辰	甲	子	0,9,20	{壬戌,辛酉,庚申,己未,戊午,丁巳,丙辰,乙卯}	{戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯}	1	戌亥戌亥	身弱	火	水木金	土	<div><br><br>缺火金 水土交戰？<br>家庭：<br>- 與兄弟姊妹肩感情還不錯，但是遇到錢財相關的事情會比較容易產生爭執，父母願意給予資助幫忙但有限。<br><br>個性：<br>- 外表嚴肅，比較少笑<br>- 不善理財，對開支的約束力較差，會有超額支出的現象<br>- 大部分時候對於金錢上會比較計較，屬於對自己大方的類型<br>- 精力旺盛靜不下來的人，需要靠勞作或是運動來消耗精力<br>- 常常會為了朋友或是金錢上煩惱，內心起伏不定<br><br>感情：<br>- 另一半在條件上會略優<br>- 雖然會一直希望與另一半的關係能夠打好，但是對於另一半的約束管教上比較會有對抗的想法，而產生矛盾的情況，若能放下對抗之心，兩人相處上會更融洽<br>- 今明年即會有對象出現，但與之在相處上常會因花錢方式造成爭吵。<br><br>事業：<br>- 不適合投資股票期貨之類，或從事風險性高的工作，容易因判斷錯誤而虧損<br>- 正式工作以外雖然會想要經營副業，但不適合，容易勞多穫少，仍須以正式工作的穩定為優先<br>- 正業可朝向食品手工藝美髮美容百貨服飾化妝品等產業發展<br>- 適合需要奔波或勞動的工作，不適合坐辦公室<br><br>身體上：<br>- 心臟心血管，眼睛，牙齒骨骼，肺為先天上會較弱的部位，需要多注意<br><br>流年：<br>- 今年可能會有一筆錢財進來，會有需要與兄弟姊妹或同事有競爭的關係<br>- 明年較有可能為了朋友或是花錢方式與另一半爭執</div>	2023-06-03 22:51:44.401955	2024-01-18 13:33:27.409906	\N	
81	PTT-Pocolio(已捐)	1	1976-03-17 16:00:00	1976-02-17 16:00:00	丙	辰	辛	卯	戊	辰	庚	申	6,1,0	{壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥}	{丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯}	1	子丑戌亥	身弱	丙火水丁火土	金木		<div>問題：因身體微恙，目前修養中。想說或是明後想考公職考試，不知道適不適合。（未婚）<br><br><br>- 做事有時候會比較情緒化跟反覆不定，表裡不一及反差較大，會讓人無所適從<br>- 此命局缺乏耐性，故不適合較為事務較瑣碎繁雜單一的公職，且個性上較不適合官僚文化重的職場，會容易與上司相處不睦。<br>- 因您的口才佳，亦喜歡與人交際，會較適合業務類型的工作<br>- 身體上宜注意肝的保養 明年要注意</div>	2023-10-05 11:28:06.439532	2024-01-18 13:56:39.498753	\N	調候重要性 通關無效
82	PTT-kcyjanet(已捐)	0	1973-05-24 04:51:00	1973-04-22 04:51:00	癸	丑	丁	巳	庚	申	戊	寅	4,4,0	{戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑}	{癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子}	1	寅卯子丑	身弱	金土	火木水		<div>PTT-kcyjanet<br>問題：考量到最近裁員潮，問現在的工作能否再撐10年？（未婚）<br><br><br>- 此命局在事業上容易異動，因此事業上想穩定十年的機率低<br>- 此命局聰明學習力強，記憶力強，領悟力亦佳，具備正心正念有愛心及耐心。但命局較大之缺失在於與父母、兄弟姊妹、另一半、朋友同事、上司下屬等的相處上，他人不會對於您的付出感恩，反之您對於他人給予的善意也容易無感，屬於六親緣份薄之現象。建議可以多親近宗教，多布施，及做事上要讓人感動，凡事以感恩之心接受，是可化解命局之中情份緣薄的問題。</div>	2023-10-12 01:17:05.412476	2024-01-18 13:57:08.979143	\N	寅巳申無恩 傷官坐印
62	PTT-fiona0906(已捐)	0	1991-09-06 10:05:00	1991-07-28 10:05:00	辛	未	丙	申	己	卯	己	巳	0,8,10	{丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰}	{辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午}	1	戌亥申酉	身強	水木金	土火		<div>問題：近期事業運跟發展方向<br><br><br><br>現在的運勢不錯，是你的才華可以有所發揮的時候，但因你26到30歲的運相當好，因此會讓你產生與現在有落差之感，適合朝向航海、業務、外交、旅遊、記者、服務業、演藝業、自由業、家具裝潢、文教教育、文化出版、宗教、公務、藥物醫藥等產業發展</div>	2023-07-23 08:45:52.680139	2024-01-18 13:43:44.377482	\N	
88	PTT介紹-懶貓不出門	0	1986-12-25 13:30:00	1986-11-24 13:30:00	丙	寅	庚	子	癸	卯	己	未	5,11,10	{己亥,戊戌,丁酉,丙申,乙未,甲午,癸巳,壬辰}	{丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑}	1	戌亥辰巳	身弱	火金水	木土		<div>問題：想問明年想搬回南部的話，運勢如何？<br><br><br>- 這幾年由於大運影響，容易想到什麼就直接行動，較少考量到後果，建議在做重大決策之前可以多尋求朋友的意見再做決定。<br>- 明年雖產生想要搬回南部的想法，但會因情感所影響而有所障礙。<br>- 因明年流年不佳，需注意會容易惹上官非，可以多親近宗教及請教長輩。</div>	2023-10-24 12:14:12.674461	2024-01-18 13:58:24.945625	\N	
34	喜酒認識	0	1993-04-30 02:50:00	1993-03-09 02:50:00	癸	酉	丙	辰	辛	巳	己	丑	1,11,0	{丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥申酉	\N	\N	\N	\N	\N	2023-06-10 15:30:28.356478	2023-06-10 15:30:28.356478	\N	\N
63	郭女	0	1994-01-10 21:30:00	1993-11-29 21:30:00	癸	酉	乙	丑	丙	申	己	亥	8,2,0	{丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥辰巳	身弱	火木	金土水			2023-07-27 01:28:00.836315	2023-07-27 01:30:04.633133	\N	\N
35	PTT-Hatsuki0824(已捐)	0	1988-08-24 04:24:00	1988-07-13 04:24:00	戊	辰	庚	申	辛	亥	庚	寅	5,6,0	{己未,戊午,丁巳,丙辰,乙卯,甲寅,癸丑,壬子}	{戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯}	1	戌亥寅卯	從強	水金土	火木		<div><br><br><br>家庭：<br>- 家世不錯，本命局高<br><br>外表/個性：<br>- 皮膚白，長相佳，且好相處<br>- 好交朋友且慷慨大方，交友廣且知己亦不少，同時朋友在各方面上對自己也有助力<br>- 精力旺盛且動力足，喜歡運動，求財心亦旺盛（（沒洩不會喜歡運動<br>- 擁有雙重性格，言行上較會有表裡不一，視情況展現不同性格的狀況<br>- 本命聰明學習力強，記憶力強，正心正念有愛心及耐心<br><br>感情：<br>- 由於工作能力強，與夫心的緣份較薄<br>- 但還沒結婚的話近幾年都有機會遇到對象，2025 26年有姻緣的機率最高<br>- 對象是有才華的人，且在事業上能夠對自己有所幫助<br><br>工作：<br>- 文武雙全，可以做文職不過更適合做需要勞動力的工作，若從事文職的話會需要靠多運動來發洩精力<br>- 可以朝向機械、汽車交通、珠寶、水利、飲料、記者、外交旅遊、服務、程式設計、自由業等產業發產<br><br>流年：<br>- 今年事業運勢上較差，工作上有財的問題要留意<br><br><br>經過再次研究後，你的命局確實比常人還高，只是因為你的大運走了太長的不好的運勢，所以不易得志，讓你產生論此命有偏離較大之感，但是此命局會越來越好。<br>大概18~22年你走的是寅巳申的大運，此為會因為朋友面子跟錢財的問題產生無恩之刑的運，而影響到上述的無情的情況，所以會讓你感覺到命局不準確的地方其中之一，也還是感謝你給我有這個學習的機會：D</div>	2023-06-11 15:11:55.182671	2024-01-18 13:35:58.00946	\N	
105	光恩無時	1	1995-01-28 21:30:00	1994-12-28 21:30:00	甲	戌	丁	丑	己	未	乙	亥	2,3,0	{戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉}	{甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉}	1	申酉子丑	\N	\N	\N	\N	\N	2024-01-05 01:36:39.044465	2024-01-05 01:36:39.044465	\N	\N
89	PTT-tina741125(已捐)	0	1985-11-25 21:30:00	1985-10-14 21:30:00	乙	丑	丁	亥	戊	辰	癸	亥	3,10,10	{戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未}	{乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	1	戌亥戌亥	身弱	火土	水金木		<div>問題：想詢問我的婚姻狀況（已婚）<br><br><br>PTT-tina741125<br>- 近幾年由於大運影響口才表現佳，但今年過後會轉回本命口才不理想的情況，所以與人相處易有冷戰之狀況。<br>- 此命局對於金錢上的節制力不佳，且有賭博之傾向，入不敷出易導致情感上的問題。財務由先生來管理會優於現狀。宜多親近宗教，亦可改善此情況</div>	2023-10-31 09:57:20.400412	2024-01-18 13:59:06.530934	\N	通關不好
98	PTT-keikin(已捐)	0	2011-01-06 14:20:00	2010-12-03 14:20:00	庚	寅	己	丑	辛	酉	乙	未	0,2,10	{戊子,丁亥,丙戌,乙酉,甲申,癸未,壬午,辛巳}	{庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑}	1	午未子丑	身強	丙火水木	丁火土金		<div>問題：身體健康問題（未婚）<br><br><br>PTT-keikin<br>- 此命局身體上最大問題在於肝膽容易出問題，另外天生腎臟，心臟，眼睛等部位較弱亦需要多加注意。今年身體會比較好但需要花費較多金錢，且近幾年健康狀況上會有反覆之現象，亦需持續留意多加小心。成年之後體弱問題會有所改善，另宜多接近宗教。<br>（結果是憂鬱症）</div>	2023-12-07 01:22:56.624622	2024-01-18 14:00:55.874354	\N	
99	PTT-akaiyume(已捐)	0	1992-08-25 06:30:00	1992-07-27 06:30:00	壬	申	戊	申	癸	酉	乙	卯	5,10,20	{丁未,丙午,乙巳,甲辰,癸卯,壬寅,辛丑,庚子}	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未}	1	戌亥戌亥	身強	火	金水		<div>問題：請問在目前的職場，未來事業及職場人際關係是否會順利（未婚）<br><br><br>- 近幾年在事業發展上尚可，主要在於才華表現找不到最有利的方式，自身亦感覺到缺乏自信，且在處事上想到什麼就做什麼，較缺乏規劃性，建議可多尋求另一半的意見。<br>- 今年有姻緣出現<br>- 內心多起伏，且有憂鬱之傾向，宜多接近宗教，可化之</div>	2023-12-11 11:34:30.491807	2024-01-18 14:01:24.640384	\N	
67	PTT-mo40411(已捐)	1	1991-08-01 11:59:00	1991-06-21 11:59:00	辛	未	乙	未	癸	卯	戊	午	8,2,10	{甲午,癸巳,壬辰,辛卯,庚寅,己丑,戊子,丁亥}	{辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午}	1	戌亥辰巳	身弱	金水	土木火		<div>問題：想知道身體健康方面（未婚）<br><br><br>mo40411<br>- 有過度享樂之傾向，尤其容易偏食<br>- 依命局，您的腸胃肝膽部位較弱，容易出問題，且易是由於您的飲食不均所造成<br>- 今年有姻緣出現<br>- 24及25歲時有因工作或投資而造成較大的破財</div>	2023-08-08 03:52:50.957691	2024-01-18 13:46:31.999977	\N	
69	PTT-GrTpen(已捐)	0	1993-10-19 18:51:00	1993-09-05 18:51:00	癸	酉	壬	戌	癸	酉	辛	酉	6,4,0	{癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥戌亥	身強	火木土	金水		<div>問題：明年要出國打工度假，雖然感覺都有照著自己的規劃前進，但不太確定自己要什麼？也擔心回國後的工作會想從事什麼，對於現階段的人生也感到迷惘，有點不知道該怎麼問問題🙏🏻（未婚）<br>此命局易多思，有憂鬱之狀況，可靠外出交友去緩解憂鬱之現象。又因不善理財，在金錢上可再適當節制，而不建議出國打工度假，可考慮在國內出遊散心。</div>	2023-08-14 13:39:13.972777	2023-08-18 15:45:02.82583	\N	偏印多唯一正官空亡
104	PTT-zlinjian(已捐)	0	1995-10-18 15:20:00	1995-08-24 15:20:00	乙	亥	丙	戌	壬	午	戊	申	6,10,10	{丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午}	{乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌}	1	申酉申酉	身弱	金水	土火木		<div>問題：未來會從事哪一方面的工作？（未婚）<br><br><br>PTT-zlinjian<br>- 此命局本身屬於為財奔波之命，且不適合投資，投資越多容易虧損越多，易走入偏道，宜多接近宗教，可化之，亦會對事業有所幫助。<br>- 會想經營副業，但較不適合，容易勞多獲少<br>- 此命局適合從事之行業：五金、機械、交通、汽車、珠寶、家電、金融、外交、旅遊、記者、服務、演藝、自由業等<br><br></div>	2023-12-13 14:12:21.512677	2024-01-18 14:02:12.422753	\N	
90	PTT-redhatmelody(已捐)	0	1987-02-14 10:00:00	1987-01-17 10:00:00	丁	卯	壬	寅	甲	午	己	巳	6,8,0	{癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥辰巳	身強	金土火	木水		<div>問題：明年有機會到加拿大生活，想知道海外的求職發展的運勢如何？（已婚）<br><br><br>PTT-redhatmelody<br>- 此命局外表佳且好相處，唯朋友不多也容易遭到朋友的背叛或利用，人情包袱重，需慎重交友<br>- 明年去加拿大所耗費的錢會高於原本的預估，雖可以在該地生存，但收入沒有預期的好，還會有負債之情況。若留在台灣維持現狀，會比去加拿大優。<br>- 近幾年與另一半吵架的情況較多，宜修口修心，多接近宗教，方能改善此情況</div>	2023-11-03 06:53:32.678486	2024-01-18 13:59:33.785149	\N	
106	PTT-sh232425(已捐)	0	1987-10-15 21:30:00	1987-08-23 21:30:00	丁	卯	庚	戌	丁	酉	辛	亥	7,9,20	{辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥辰巳	身弱	火木	金土水		<div>問題：目前單身，想問感情路（未婚）<br><br><br>- 本命外表佳，口才好且好相處，對朋友亦大方，但在開銷上宜多節制<br>- 今年其實已有對象出現，但會因雙方在開銷的問題上想法不一致而產生不愉快，明年有良緣出現，可以善加把握，但亦需注意表現上跟對象易有衝突，宜適當節制，修口修心，多接近宗教，可化之</div>	2024-01-10 08:32:25.47599	2024-01-18 14:02:43.034565	\N	
96	賴紀蓓	0	1965-10-08 21:10:00	1965-09-14 21:10:00	乙	巳	丙	戌	乙	未	丁	亥	10,0,0	{丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午}	{乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰}	1	寅卯辰巳	身弱	木水金	土火			2023-11-28 13:13:45.02165	2023-11-28 13:15:48.719026	\N	
97	PTT-CHENX(已捐)	1	1993-09-25 12:16:00	1993-08-10 12:16:00	癸	酉	辛	酉	己	酉	庚	午	5,10,10	{庚申,己未,戊午,丁巳,丙辰,乙卯,甲寅,癸丑}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥寅卯	身弱	火土	金水甲木	乙木	<div>問題：工作事業該往哪些方向發展比較適合（未婚）<br><br><br>PTT-CHENX<br>- 在職場上您的個性較容易與上司起衝突而造成上司不喜，會適合組織扁平化，上下關係較不分明，或沒有實質上司的職場，另因您喜歡與人接觸，可以朝向新創公司的業務方向或或保險業務去尋找，並需注意在工作上要多做少說，因容易說錯話而得罪他人。<br>- 亦有設計上的天賦，也可以考慮往此方面嘗試<br>- 在交友上會因您容易在言語上有不適切的表達，易造成朋友無法接受，而影響到人際關係。<br>- 內心多鬱結，宜多接近宗教並修口修心，並可改善上述情況</div>	2023-12-04 06:19:58.291639	2024-01-18 14:00:30.679013	\N	
109	PTT-kraftwek(已捐)	0	1992-08-24 03:50:00	1992-07-26 03:50:00	壬	申	戊	申	壬	申	壬	寅	5,6,10	{丁未,丙午,乙巳,甲辰,癸卯,壬寅,辛丑,庚子}	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未}	1	戌亥戌亥					<div>問題：婚姻相處的建議（已婚）<br>PTT-kraftwek<br>本命局易因想法上的不同，而夫妻之間有所衝突，加上命主難以詮釋自身想法而無法完全化解矛盾，另又因較為陽剛，不懂放軟身段發揮女性的特長，導致情感上會多波折。除了建議可適時放下身段求和外，多親近宗教，可使思緒較為清晰，及增進表達能力，便能改善問題。今年秋天過後，夫妻關係會有所改善。</div>	2024-01-30 01:15:14.59382	2024-02-04 15:20:42.949387	\N	
117	test	1	2019-06-07 12:12:00	2019-05-05 12:12:00	己	亥	庚	午	乙	亥	壬	午	0,4,20	{己巳,戊辰,丁卯,丙寅,乙丑,甲子,癸亥,壬戌}	{己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌}	1	辰巳申酉	\N	\N	\N	\N	\N	2024-02-23 15:13:09.035831	2024-02-23 15:13:09.035831	\N	\N
118	test2	0	2019-06-07 12:12:00	2019-05-05 12:12:00	己	亥	庚	午	乙	亥	壬	午	10,1,0	{辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅}	{己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌}	1	辰巳申酉	\N	\N	\N	\N	\N	2024-02-23 15:13:38.148323	2024-02-23 15:13:38.148323	\N	\N
74	隋其樺	1	1969-03-17 12:36:00	1969-01-29 12:36:00	己	酉	丁	卯	辛	卯	甲	午	3,9,20	{丙寅,乙丑,甲子,癸亥,壬戌,辛酉,庚申,己未}	{己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申}	1	寅卯午未	\N	\N	\N	\N	\N	2023-09-05 12:58:52.831287	2023-09-05 12:58:52.831287	\N	\N
9	黎光騏	1	1996-01-02 21:30:00	1995-11-12 21:30:00	乙	亥	戊	子	戊	戌	癸	亥	8,8,0	{丁亥,丙戌,乙酉,甲申,癸未,壬午,辛巳,庚辰}	{乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌}	1	申酉辰巳	身弱	土火	水金木		<div>事業宮正財來和 但為忌神 無需擔憂基本開銷但不多<br>財過旺 為忌 導致容易遇到女生會欺負他<br><br>27歲財（爸爸）出問題（已確定2017走的<br>27歲流年子丑合 比肩來合正財<br>28歲流年寅亥合 印來合兩個偏財<br>29歲流年逢未月 亥卯未&nbsp;<br>29歲流年卯戌合 夫妻宮動<br>31歲巳亥沖 寅來沖兩個偏財<br>＝＝＝＝＝＝＝＝＝＝＝＝<br>盡量不要論到父母生死&nbsp; 可以提一下身體<br>27歲亥子丑 負面很強 問發生什麼是</div>	2023-05-06 18:20:53.698746	2024-01-12 14:03:44.115198	\N	
107	PTT-coldeye(已捐)	1	1979-02-11 21:30:00	1979-01-15 21:30:00	己	未	丙	寅	己	酉	乙	亥	2,4,20	{乙丑,甲子,癸亥,壬戌,辛酉,庚申,己未,戊午}	{己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午}	1	子丑寅卯	身弱				<div>問題：何時能找到「長期(10年以上)/終身」的正式職位？（未婚）<br>- 近幾年因大運影響，行事上較以往衝動，缺乏耐心及主見等現象。今年由於流年影響，導致事業上因才華表現略輸同事，而影響到收入。凡事盡心盡力，另宜多接近宗教，自然會越來越好。<br>- 今明兩年身體較差<br>- 明年宜注意桃花而破財</div>	2024-01-18 13:22:15.09805	2024-01-19 16:03:08.630032	\N	
119	蔡凱強老婆	0	1980-06-21 02:30:00	1980-05-09 02:30:00	庚	申	壬	午	乙	丑	丁	丑	5,0,20	{辛巳,庚辰,己卯,戊寅,丁丑,丙子,乙亥,甲戌}	{庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未}	1	子丑戌亥	\N	\N	\N	\N	\N	2024-03-01 06:23:31.779568	2024-03-01 06:23:31.779568	\N	\N
79	PTT-smallta(已捐)	1	1986-04-17 09:30:00	1986-03-09 09:30:00	丙	寅	壬	辰	辛	卯	癸	巳	6,3,0	{癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子}	{丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑}	1	戌亥午未	身弱	金土	木水火		<div>問題：想問工作未來的選擇跟現況（未婚）<br><br><br>smallta<br>- 事業上有才華，但常有有志難伸之感，雖有許多理想，卻較缺乏執行力而無法達成。<br>- 近幾年大運流年皆較差，多耗財<br>- 因您的口才佳，但執行力較差的緣故，會較適合從事銷售業務類型的工作<br>- 建議可往機械，汽車，珠寶家電金融房地產企管顧問秘書經銷代理商代書等產業發展</div>	2023-09-27 06:46:00.463421	2024-01-18 13:55:33.231782	\N	
83	PTT-appleasy(已捐)	0	1987-02-22 12:45:00	1987-01-25 12:45:00	丁	卯	壬	寅	壬	寅	丙	午	3,11,20	{癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥辰巳	從弱		水金		<div>問題：何時可以換工作？（適合自己且薪資比現在高）（未婚）<br><br><br>PTT-appleasy<br>- 做事較為衝動，想到什麼就直接行動，較少考量到後果，應三思而後行。<br>- 本造命格局高，運勢佳，這兩年因流年較差而感覺到在事業上不順遂，此現象今年過後即會有所改善，明年便有機會換到更好的工作。唯在感情上會較為不順遂，因心直口快，言語上容易傷害到另一半，宜修口修心，方能改善此問題<br>- 可多接近宗教，有空多去文昌帝君廟走走</div>	2023-10-12 01:18:58.636959	2024-01-18 13:57:34.170928	\N	
121	jinho	1	1993-01-04 13:17:00	1992-12-12 13:17:00	壬	申	壬	子	乙	酉	癸	未	0,4,10	{癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申}	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未}	1	戌亥午未	\N	\N	\N	\N	\N	2024-03-29 14:12:55.706872	2024-03-29 14:12:55.706872	\N	\N
17	郭2	1	2023-05-24 18:45:00	2023-04-06 18:45:00	癸	卯	丁	巳	壬	午	己	酉	6,2,20	{丙辰,乙卯,甲寅,癸丑,壬子,辛亥,庚戌,己酉}	{癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅}	1	辰巳申酉	\N	\N	\N	\N	\N	2023-05-24 12:32:21.996859	2023-05-24 12:32:21.996859	\N	\N
111	PTT-loischune(已捐)	0	1983-08-13 06:48:00	1983-07-05 06:48:00	癸	亥	庚	申	癸	酉	乙	卯	8,9,10	{辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	{癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌}	1	子丑戌亥	身強	火土木	金水		<div>北部人育有兩子，七年前隨老公移居台中成為全職媽媽，因希望找到生活重心延續職涯，預計過完年後返回職場二度就業，不知後續家庭(夫妻及子女)關係的安排要如何調整較合適，希望能有方向或建議。（已婚）<br>PTT-loischune<br>本命局夫妻間易因想法及表現而多衝突，尤其去年口角情況更甚。今年重回職場對您的命局是有利的決定，夫妻子女之間的關係都會有所改善，且在事業上亦能發揮所長，有良好的表現。整體而言今年對您在事業及家庭上都會是平穩順利的一年，不必過於憂慮。</div>	2024-02-07 01:58:40.114449	2024-02-11 22:35:38.425887	\N	
95	PTT-irene801015(已捐)	0	1991-10-15 04:10:00	1991-09-08 04:10:00	辛	未	戊	戌	戊	午	甲	寅	8,0,10	{己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午}	{辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午}	1	戌亥子丑	身強	金木水	土火		<div>問題：感情，目前遇到的這位非常用心，想要知道我和他的建議發展（未婚）<br><br><br>- 2025年身體可能會出較大的問題，需先預防並多注意心血管及腎 子宮方面的保養<br>- 本命桃花旺，在選擇上會比較有猶豫的情況，目前的對象雖各方面都能對你有幫助，但明年之後可能會產生變動。最有可能結婚為3637</div>	2023-11-14 09:06:12.589504	2024-01-18 14:00:03.52238	\N	
53	PTT-vivame(已捐)	0	1985-05-23 09:44:00	1985-04-04 09:44:00	乙	丑	辛	巳	壬	戌	乙	巳	4,6,20	{壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑}	{乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	1	戌亥子丑	身弱	金水	土火木		<div>問題：目前這個工作是否能長遠順利（未婚）<br><br><br>個性：<br>-&nbsp;<br>感情：<br>- 今年及明年有姻緣出現</div>	2023-07-12 13:23:53.346647	2024-01-18 13:41:17.215938	\N	
120	郭友	0	1993-05-04 17:33:00	1993-03-13 17:33:00	癸	酉	丙	辰	乙	酉	乙	酉	0,4,10	{丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥午未					<div>問工作 未婚<br><br>去年工作變動是換了比較好的工作，但會比較辛苦，今年會出現收入不如付出的情況<br>跟父母兄弟的感情不好<br>去年感情也有變動<br>依賴父母跟另一半的金錢支援</div>	2024-03-04 05:39:07.98091	2024-03-09 14:38:24.071219	\N	
110	PTT-gniyaihc(已捐)	0	1989-02-18 10:00:00	1989-01-13 10:00:00	己	巳	丙	寅	己	酉	己	巳	5,2,0	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥寅卯	身強	水木金	火土		<div>我是醫療影像行業，最近AI發展迅猛，我害怕工作會被取代，或是收入減少，請問1.是否/何時會被取代2.有什麼適合我命格的具體建議(順其自然？投資？發展何種副業？)（已婚）<br>PTT-gniyaihc<br>這兩年因流年影響，會感覺到在原本的工作上難以發揮，而有所擔憂，因您本命需盡量避免較高風險的投資，僅適合穩健性的理財，且您也另有其他的才華，因此今年可以往與醫療相關的行業尋找兼職或副業。去年及今年對您來說會是變動較多的時節，夫妻間亦多有衝突，但今年過後便會有所改善。</div>	2024-02-06 07:06:55.860712	2024-02-11 22:36:53.69975	\N	特殊
75	PTT-Qazwsx3(已捐)	0	1992-03-03 13:30:00	1992-01-29 13:30:00	壬	申	壬	寅	戊	寅	己	未	9,2,20	{辛丑,庚子,己亥,戊戌,丁酉,丙申,乙未,甲午}	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未}	1	戌亥申酉	身弱	火土	木水金		<div>問題：想知道工作運 及建議職業方向（已婚）<br><br><br>PTT-Qazwsx3<br>- 做事較為衝動，想到什麼就直接行動，較少考量到後果，做事上亦較為急躁激進，容易與人發生摩擦，應三思而後行。<br>- 好交朋友且慷慨大方，知己亦不少，尤其在事業上能獲得不少朋友的助力。<br>- 近幾年大運不錯，尤其在2021年，流年亦佳，在事業上有比較多的收入進帳，惟官非亦會較多，需要小心。<br>- 明年會因為上司的管理方式有變而導致收入減少，但工作上亦會有貴人來相助，因此不會造成太大的影響。<br>- 適合比較需要勞力，常常四處奔波，如仲介類型的工作，但在工作上需要鑽研到足夠的水準，自然就會穩定下來。<br>2025無恩之刑</div>	2023-09-12 13:07:35.671067	2024-01-18 13:50:10.597645	\N	
124	PTT-speedlone	1	1985-12-11 10:00:00	1985-10-30 10:00:00	乙	丑	戊	子	甲	申	己	巳	1,3,20	{丁亥,丙戌,乙酉,甲申,癸未,壬午,辛巳,庚辰}	{乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子}	1	戌亥午未					<div>問題：此命盤大概是什麼樣的人（已婚）<br>- 此命局喜兼業，有多種收入管道，財源不缺，看重金錢<br>- 財源具有豐富的多元性，加上懂得理財，可....<br>- 桃花旺異性緣佳，自己也樂在其中<br>- 今年由於財務上的問題而影響家裡<br>- 本身自有想法，但為了整體的圓滿，比較容易配合別人的方式<br><br>此命局看重金錢，並且喜兼業，具有多種收入管道，加之懂得理財，財源不缺。<br>感情上桃花旺異性緣佳，自己也樂在其中。<br>個性上隨和好相處且有耐心及愛心，但不擅長拒絕，常會為了整體的圓滿而配合他人的要求。<br>今年有因財務上的問題而影響家裡的現象，亦會容易憂鬱。</div>	2024-07-05 07:30:55.737895	2024-07-08 01:25:41.656633	\N	
112	同性戀男	1	2004-08-03 23:30:00	2004-06-18 23:30:00	甲	申	辛	未	甲	寅	丙	子	1,2,10	{壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯}	{甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未}	1	午未子丑	\N	\N	\N	\N	\N	2024-02-19 01:37:50.778387	2024-02-19 01:37:50.778387	\N	\N
87	PTT-playmoney(已捐)	1	2001-08-29 11:50:00	2001-07-11 11:50:00	辛	巳	丙	申	甲	子	庚	午	7,3,0	{乙未,甲午,癸巳,壬辰,辛卯,庚寅,己丑,戊子}	{辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰}	1	申酉戌亥	身弱	土水木	金火		<div>問題：人際跟感情這部分，這兩方面不怎麼好，比較想知道感情，能不能到喜歡自己的人（未婚）<br><br><br>- 在職場上您的個性較容易與上司起衝突而造成上司不喜，並需注意在工作上要多做少說，因容易說錯話而得罪他人。<br>- 本命天生聰明且學習例強，剛開始認識時會覺得您是一個好相處好說話的人，不過在深入交流之後會因您容易在言語上有不適切的表達，易造成朋友無法接受，而影響到人際關係。<br>- 一直以來身邊較缺乏桃花，不過明年即有姻緣顯現，可以積極把握，但一樣需注意言語上容易傷害到另一半，宜修口修心，方能改善此問題<br>- 內心多起伏，宜多屆進宗教，可化之<br><br>- 命盤適合早婚，且對象佳，各方面可幫助命主</div>	2023-10-24 12:06:39.897305	2024-01-18 13:57:59.474481	\N	
4	郭鴻毅	1	1993-02-25 13:30:00	1993-02-05 13:30:00	癸	酉	甲	寅	丁	丑	丁	未	7,1,20	{癸丑,壬子,辛亥,庚戌,己酉,戊申,丁未,丙午}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥申酉	身強				<div>不喝飲料<br>空亡的沖剋合還是照一般來論&nbsp; 非解空就好<br>31歲卯酉沖&nbsp; 偏印來沖 思想上/設計上/事業上出問題&nbsp; 也有可能為了家裡花錢<br>（組被宮可能可以論事業 但是不要主動談 若事業通沒看出問題，組被公有沖剋合，但有被問，就能論）<br>33歲巳酉丑為好 巳為比節 夫妻宮動 有可能是親戚朋友/長輩介紹來的，爸爸好滿意，來促成這個緣份<br>比肩的特性是耗財<br><br>2020 我還在日本工作<br>3-4月<br>回台灣，後來日本鎖國我就回不去變成在台灣遠端工作，然後跟現任女友在曖昧<br>5月<br>萌生辭職念頭，順便台灣找工作，後來有找到<br>6月<br>提離職然後開始台灣的新工作，但日本那邊是說等我回去談談再決定去留，所以變成兩份工作同時進行<br>7月<br>發現台灣工作不適合自己，不管是職務內容還是人際關係都不喜歡，提離職。月中日本主管突然說要離職的話可以，把寄過來的文件簽一簽寄回去就可以了。但我的日本同事跟我說公司要解散的事情，如果簽離職拿不到錢，遣散金是一年薪水未稅，所以後來沒簽離職<br>8月<br>日本公司解散，日本帳戶拿到一筆錢。台灣公司離職。暫時無工作。跟現任女友在一起<br>9月<br>跟女友和女友朋友去澎湖玩<br>10月<br>回日本把租房、水電網路瓦斯等等退掉，回日本公司走完後續流程，把一部分錢帶回台灣。月底五倍開課<br>11月<br>五倍上課<br>12月<br>五倍上課<br>2021 1月<br>五倍上課<br>2021 2月<br>面試<br>2021 3月<br>找到工作<br><br>2017 想在日本工作 但我知道一開始不可能<br>2018 1月到日本<br>2018 年底極度想找到工作<br>2019 2月入職<br>2018 有對象 還想結婚</div>	2023-05-02 03:38:04.407871	2024-06-07 07:45:43.820815	\N	
28	PTT-chukuel	0	1987-06-26 11:11:00	1987-06-01 11:11:00	丁	卯	丙	午	丙	午	甲	午	3,9,20	{丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥寅卯	從強	土木火	水金		<div><br><br><br>好勝心強，不喜歡別人拿話激你，吃軟不吃硬<br>午午自刑常常事與願違在決定一件事情錢請運逆向溝通先拍馬屁以禮相待則好溝通<br>子午卯酉人緣桃花旺<br>母親身體較差或是關係較不好<br>有著反差蠻大的性格，平時在外會視情況來選擇展現適合的一面來迎合他人，但有時候想的與做的不一樣，處事上也較為情緒化，會導致他人無所適從<br>性格上比較衝動暴躁沒耐性，做事我行我素，不與另一半商量，也不喜歡另一半來管自己，容易產生對抗之心，若能放下對抗之心，在感情上會比較順利少爭吵<br>與另一半會常因朋友而發生爭執，在事業也意見不和，兩方都是吃軟不吃硬的人，若不先放下身段，常常難以進行有效溝通，心中有苦說不出</div>	2023-06-04 02:53:52.609382	2024-01-18 13:34:18.882116	\N	
116	同性戀男2	1	1989-09-01 12:00:00	1989-08-02 12:00:00	己	巳	壬	申	甲	子	庚	午	8,2,10	{辛未,庚午,己巳,戊辰,丁卯,丙寅,乙丑,甲子}	{己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	1	戌亥戌亥						2024-02-19 12:23:25.544246	2024-02-19 12:26:02.109501	\N	
29	PTT-redbirdy(已捐)	0	1987-01-26 08:30:00	1986-12-27 08:30:00	丙	寅	辛	丑	乙	亥	庚	辰	6,8,10	{庚子,己亥,戊戌,丁酉,丙申,乙未,甲午,癸巳}	{丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑}	1	戌亥申酉	身弱	火木水	土金		<div><br><br>個性：<br>- 外表上好相處，是朋友認證的好好先生/小姐<br>- 對於自我的道德約束上是有要求相當要求的，是奉公守法的人，較不會走旁門左道<br>- 平常為人大方不拘小節，喜歡社交活動多，對開支的約束力較差，會有超額支出的現象<br><br>感情：<br>- 應為早婚一族<br>- 若還沒結婚，40歲有機會<br>- 若已經結婚或有另一半，會是正直聰明，有耐心的對象<br>- 另一半條件會優於自己<br>- 先生助力有限，且兩人相處上有時候會造成壓力較大的情況<br><br>事業：<br>- 今年事業上會有朋友來助，但是也要注意錢財上若有該分給他人的要適當去分享<br>- 本身會想要去發展副業，但較不適合，會有勞多穫少的情況，宜專注於本業發展<br>- 正業可以往食品業，音樂文創，文具文化事業，教育，醫藥，交通飲食，服飾百貨，化妝保養，自由業等方向發展<br><br>身體：<br>- 脾胃，消化道較容易出問題，需要多注意<br><br></div>	2023-06-06 14:33:09.546787	2024-01-18 13:35:12.924508	\N	
36	PTT-aaaaaj(已捐)	0	1988-05-27 18:50:00	1988-04-12 18:50:00	戊	辰	丁	巳	壬	午	己	酉	7,4,10	{丙辰,乙卯,甲寅,癸丑,壬子,辛亥,庚戌,己酉}	{戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯}	1	戌亥申酉	身弱	木水金	火土		<div><br><br>個性：<br>- 優柔寡斷<br>- 較容易沉迷於不良的習慣或娛樂，對開支的約束力也較差，容易超額支出，需要注意<br>- 外表較嚴肅帶殺氣，少笑，不過其實是好相處的人<br>- 動能不足，不喜運動亦不適合勞動<br>- 朋友少，雖會努力尋求朋友，但大多需要靠錢財才能交到，且朋友對自己助力有限<br><br>感情：<br>- 桃花旺，但感情路較為不順遂，自身也優柔寡斷，容易遇人不淑<br>- 另一半較容易有暴力傾向，且在錢財上會比較計較，需要注意<br>- 若還未結婚，2026 27有姻緣的機會最高<br>- 若有對象明年容易因事業而有爭吵<br>- 子女緣份較薄<br><br>工作：<br>- 不適合從事需要勞動的工作<br>- 不適合投資股票期貨之類，或從事風險性高的工作，容易因判斷錯誤而虧損<br>- 雖會想要發展副業但不適合，容易勞多穫少，最好還是能專注在正業上<br>- 可以朝向教育文化出版、宗教、司法軍警公務員、交通、服務、程式設計等產業發產<br>- 適合從事買空賣空的工作，如業務類，或是宗教相關<br><br>身體上：<br>- 免疫及神經系統、肝膽、眼睛、牙齒骨骼、肺為先天上會較弱的部位，容易出問題，需要多注意<br><br></div>	2023-06-13 15:11:54.373004	2024-01-18 13:36:42.818954	\N	
39	PTt-beautyqu(已捐)	0	1982-03-29 20:30:00	1982-03-05 20:30:00	壬	戌	癸	卯	辛	亥	戊	戌	7,10,10	{壬寅,辛丑,庚子,己亥,戊戌,丁酉,丙申,乙未}	{壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉}	1	子丑寅卯	身弱	火金土	水木		<div>問題：婚姻關係如何改善<br><br><br>個性/外表：<br>- 皮膚較白，長相佳<br>- 本命聰明學習力強，記憶力強，正心正念有愛心及耐心<br>- 口才佳，表現慾強<br>- 重感覺，不過其實是好相處的人<br>感情：<br>- 口直心快，口頭上易得罪於人，容易得理不饒人，需要適當節制<br>- 有才華可以把才華展現在工作上，專注於工作上自然會減少夫妻間的衝突<br>- 以上兩者並行的話就可以降低與丈夫間吵架頻繁的情況<br>工作：<br>- 適合朝向食品、手工藝、雕刻飾物、百貨服飾、化妝保養美容美甲、交通、珠寶、家電、金融等產業發產<br>身體：<br>- 腦部、眼睛、心臟心血管，腎臟膀胱排泄系統等部位較容易出問題<br><br></div>	2023-06-18 15:31:01.538321	2024-01-18 13:37:17.454704	\N	
43	PTT-reanimation(已捐)	0	1988-10-28 12:30:00	1988-09-18 12:30:00	戊	辰	壬	戌	丙	辰	甲	午	6,8,10	{辛酉,庚申,己未,戊午,丁巳,丙辰,乙卯,甲寅}	{戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯}	1	戌亥子丑	身弱	金木火	土水		<div>問題：工作運勢（未婚）<br><br><br>個性：<br>- 嘴快，話語常常未經思考就說出來，但事後會為了說出口的話而後悔，而思緒常常起伏不定<br>- 身體較差，容易疲勞，常感覺精神力無法集中<br>- 自信超出實力<br><br>事業：<br>- 雖有才華但難以發揮，有志難伸之感，常常無法發揮預期的實力<br>- 想要達成的目標高遠，但執行力及推動力較缺乏<br>- 近年在事業上有容易因較為情緒化的表現而影響到收入，到明年底此情況會稍微改善，但會容易與他人有口舌之爭<br><br>婚姻：<br>- 明年底會有姻緣但明顯度不高，且容易有口舌爭執<br><br>身體：<br>- 血液、腎臟、泌尿系統，牙齒、骨頭、肺、脾胃消化道需注意，較容易出問題</div>	2023-07-04 11:52:20.050177	2024-01-18 13:37:49.956021	\N	
50	PTT-hscheart女兒(已捐)	0	2013-01-19 21:06:00	2012-12-08 21:06:00	壬	辰	癸	丑	乙	酉	丁	亥	4,9,20	{壬子,辛亥,庚戌,己酉,戊申,丁未,丙午,乙巳}	{壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯}	1	午未午未	身弱	木	土火金	水	<div>問題：跟女兒的相處之道<br><br><br>女兒目前處於一個善變且容易憂鬱的狀態，且爸媽對她的管教會造成她更大的壓力，建議找比她大2~5的哥哥姐姐陪玩，從陪玩去了解女兒的狀態，才有辦法從中協助並改善。</div>	2023-07-09 12:20:29.86971	2024-01-18 13:40:38.008854	\N	
44	PTT-dawnen7799(已捐)	1	1994-05-21 21:30:00	1994-04-11 21:30:00	甲	戌	己	巳	丁	未	辛	亥	5,1,10	{庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑}	{甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉}	1	申酉寅卯	身弱	木火	土金水		<div>問題：事業不順，之前換了不少次工作，目前是公務人員，工作上經常發生因他人影響加上自己的部份過失而造成出錯，該如何改善（未婚）<br><br><br>- 外表是好相處的人，但其實心理上頗為叛逆<br>- 工作上私下跟同事有交流時要注意談話內容，有可能容易因此傷到長官的威信<br>- 容易因擋到他人財路而招致小人，需要注意<br>- 今年在工作上會有比較具創造力的表現，但反而可能因此招致小人，明年年中過後事業上的小人造成犯錯的情況會有改善<br>- 今年有成家的想法，會有姻緣出現<br>- 身體健康狀況基本上不錯 ，但要注意脾胃消化系統、牙齒、骨骼、肺部、腎臟、排泄系統的保養</div>	2023-07-04 11:53:22.798863	2024-01-18 13:38:32.172731	\N	
59	PTT-c58264cathy(已捐)	0	1990-03-01 09:30:00	1990-02-05 09:30:00	庚	午	戊	寅	乙	丑	辛	巳	8,4,0	{丁丑,丙子,乙亥,甲戌,癸酉,壬申,辛未,庚午}	{庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳}	1	戌亥戌亥	身弱	水木	火金土		<div>問題：工作室的生意何時能夠平穩且持續每個月有10個case以上（已婚）<br><br><br><br><a href="http://localhost:3010/users/59">PTT-c58264cathy(已捐)</a><br>針對問題的回覆：<br>前幾年的運勢上還算不錯，但會從今年運勢開始轉差，要注意對自己的要求勿過高，盡量保守為宜<br><br>個性：<br>- 優柔寡斷，身邊異性緣佳<br>- 較無自己的想法，並且較缺乏自信<br>- 擁有雙重性格，言行上較會有表裡不一，視情況展現不同性格的狀況<br><br>事業：<br>- 不適合投資股票期貨之類，或從事風險性高的工作，容易因判斷錯誤而虧損<br>- 正式工作以外雖然會想要經營副業，但不適合，容易勞多穫少，仍須以正式工作的穩定為優先<br><br>身體：<br>- 血液、腎臟膀胱排泄系統較容易出問題，需要多注意</div>	2023-07-16 11:57:12.265711	2024-01-18 13:41:58.308086	\N	
60	PTT-chukuei(已捐)	0	1987-06-26 11:11:00	1987-06-01 11:11:00	丁	卯	丙	午	丙	午	甲	午	3,9,20	{丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅}	{丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅}	1	戌亥寅卯	從強	土木火	金水		<div>問題：正緣何時出現？（未婚）<br><br><br><br><br><a href="http://localhost:3010/users/60">PTT-chukuei(已捐)</a><br>個性：<br>- 好交朋友且慷慨大方，交友廣且知己亦不少，同時朋友在各方面上對自己也有助力<br>- 擁有雙重性格，言行上較會有表裡不一，視情況展現不同性格的狀況<br>- 本命聰明學習力強，記憶力強，正心正念有愛心及耐心<br><br>感情：<br>- 由於工作能力強，與夫心的緣份較薄，建議當有合適對象出現時主動出擊，積極把握機會<br>- 2026、27年有姻緣出現，27年結婚會較好<br>- 對於對象各方面的條件都有所要求，尤其經濟上的能力會比較重視，建議要降低標準，在緣份上會比較廣<br>- 在錢財及朋友上與對象會有較多不合之處，建議此方面能持開放態度，方能長久<br><br>工作：<br>- 適合需要勞動及需要創造力的職業<br>- 可以朝向房地產、建築、機械、管理顧問相關、設計、秘書、經銷代理商等產業發產<br><br>身體：<br>- 血液、腎臟膀胱排泄系統，骨骼牙齒及肺部較容易出問題，需要多注意</div>	2023-07-18 14:02:55.029144	2024-01-18 13:42:40.600533	\N	純印比從強格 午午刑
122	PTT-king4647	1	1990-03-10 20:00:00	1990-02-14 20:00:00	庚	午	己	卯	甲	戌	甲	戌	8,6,10	{庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥}	{庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳}	1	戌亥申酉	身弱	火金			<div>問題：今年感情運如何 有沒有機會脫單（未婚）<br>- 此命局易有二婚之情況<br>- 今年桃花旺，但不易有結果。另副業近幾年經營較為辛苦，宜先專注於本業上，感情上亦會較為順遂。<br>- 與人相處上應注意話語容易傷到他人，宜多保守。<br>- 多親近宗教<br>- 做事較為衝動，想到什麼就直接行動，較少考量到後果，應三思而後行。</div>	2024-04-25 01:45:37.42374	2024-04-29 13:56:18.71285	\N	
61	PTT-h8545jk23(已捐)	0	1997-01-01 15:57:00	1996-11-22 15:57:00	丙	子	庚	子	癸	卯	庚	申	8,6,0	{己亥,戊戌,丁酉,丙申,乙未,甲午,癸巳,壬辰}	{丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥}	1	申酉辰巳	身強	土火木	水金		<div>問題：職涯跟學業發展（未婚）猶豫要出國進修還是工作<br><br><br>從你的命盤看起來，基本上你已經決定要出國留學了，但此舉其實會造成家裡的負擔過大。明年底你開始走財運，所以求學不宜，求財可，方可營造自己跟家裡的雙贏局面。事業可以朝向宗教相關、房地產建築、仲介、管理、企管顧問、設計、秘書、經銷代理商等產業發展<br>個性：<br>- 具有理財觀念，對錢財相當敏感，較為計較<br>- 喜歡事物安排的井然有序，一板一眼<br>- 交友雖廣但難得知己，也容易遭到朋友的背叛或利用，人情包袱重，需慎重交友<br>- 缺乏自制力，最好能靠另一半來約束自己<br>事業：<br>可以朝向宗教相關、房地產建築、仲介、管理、企管顧問、設計、秘書、經銷代理商等產業發展<br><br>身體：<br>- 水金出問題</div>	2023-07-23 08:39:30.896899	2024-01-18 13:43:12.319787	\N	
64	PTT-Shayoun(已捐)	1	1991-10-20 05:37:00	1991-09-13 05:37:00	辛	未	戊	戌	癸	亥	乙	卯	3,8,10	{丁酉,丙申,乙未,甲午,癸巳,壬辰,辛卯,庚寅}	{辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午}	1	戌亥子丑	身弱	火金水	木土		<div>問題：何時出現合適對象及建議，工作是軟體工程師，對未來職涯的指點（未婚）<br><br><br>Shayoun<br>- 2025年會有姻緣出現，可以好好把握<br>- 在夫妻相處上會是屬於比較容易有言詞不當及過度表達的表現的一方，會因此影響到夫妻感情，需要多注意<br>- 軟體工程師是你能夠發揮才華的工作，但因你在事業較容易與上司有理念不合而有爭執的情況，因此不易得上司歡心，並且在表現上會出現無法如預期發揮之感，盡量多做少說為宜</div>	2023-07-31 13:09:29.256857	2024-01-18 13:44:51.594643	\N	
65	PTT-lun1008(已捐)	0	1993-10-08 06:30:00	1993-08-23 06:30:00	癸	酉	辛	酉	壬	戌	癸	卯	0,1,10	{壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥子丑	從強	金水木	火土		<div>問題：感情婚姻（未婚）<br><br><br>- 由於工作能力強，與夫心的緣份較薄，建議當有合適對象出現時主動出擊，積極把握機會<br>- 明年會有姻緣出現<br>- 近幾年在事業上頗有不得志之感，且在今年家中亦與家人有諸多爭執，此現象在明年即會有所改善<br><br></div>	2023-07-31 13:22:59.031416	2024-01-18 13:45:21.777158	\N	
66	PTT-sherry228(已捐)	0	1986-02-28 01:30:00	1986-01-20 01:30:00	丙	寅	庚	寅	癸	卯	癸	丑	7,10,10	{己丑,戊子,丁亥,丙戌,乙酉,甲申,癸未,壬午}	{丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申,癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑}	1	戌亥辰巳	身弱	金水	木火土		<div>問題：今年工作感覺卡卡的，轉調會比較好嗎（已婚）<br><br><br>sherry228<br>- 本命局與上司緣份較薄，易有衝突<br>- 因今年開始您轉較差的運，在工作上的表現不佳而造成上司不喜，若能選擇轉調的話，換個新環境，且注意在工作上要多做少說，因容易說錯話而得罪他人，從頭開始會是較好的選擇。<br>- 明年在夫妻相處上易有嚴重衝突，需要注意</div>	2023-08-08 03:47:17.567055	2024-01-18 13:45:57.737691	\N	
68	PTT-givi0089(已捐)	0	1993-08-21 13:06:00	1993-07-04 13:06:00	癸	酉	庚	申	甲	戌	辛	未	5,9,10	{辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰}	{癸酉,甲戌,乙亥,丙子,丁丑,戊寅,己卯,庚辰,辛巳,壬午,癸未,甲申,乙酉,丙戌,丁亥,戊子,己丑,庚寅,辛卯,壬辰,癸巳,甲午,乙未,丙申,丁酉,戊戌,己亥,庚子,辛丑,壬寅,癸卯,甲辰,乙巳,丙午,丁未,戊申,己酉,庚戌,辛亥,壬子,癸丑,甲寅,乙卯,丙辰,丁巳,戊午,己未,庚申,辛酉,壬戌,癸亥,甲子,乙丑,丙寅,丁卯,戊辰,己巳,庚午,辛未,壬申}	1	戌亥申酉	身弱	火水木	金土		<div>問題：什麼時候會遇到正緣（未婚）<br><br><br>givi0089<br>- 此本命局桃花很旺，但是爛桃花也多，較容易遇到不好的對象，自身也優柔寡斷，需要慎選對象。今年已經有姻緣出現，但有競爭之狀況，在明年會有正桃花出現。<br>- 明年會因身體出狀況而需要破財之情況</div>	2023-08-14 13:38:08.286418	2024-01-18 13:47:00.219104	\N	
\.


--
-- Name: action_text_rich_texts_id_seq; Type: SEQUENCE SET; Schema: public; Owner: lvguanlin
--

SELECT pg_catalog.setval('public.action_text_rich_texts_id_seq', 1, false);


--
-- Name: active_storage_attachments_id_seq; Type: SEQUENCE SET; Schema: public; Owner: lvguanlin
--

SELECT pg_catalog.setval('public.active_storage_attachments_id_seq', 1, false);


--
-- Name: active_storage_blobs_id_seq; Type: SEQUENCE SET; Schema: public; Owner: lvguanlin
--

SELECT pg_catalog.setval('public.active_storage_blobs_id_seq', 1, false);


--
-- Name: active_storage_variant_records_id_seq; Type: SEQUENCE SET; Schema: public; Owner: lvguanlin
--

SELECT pg_catalog.setval('public.active_storage_variant_records_id_seq', 1, false);


--
-- Name: users_id_seq; Type: SEQUENCE SET; Schema: public; Owner: lvguanlin
--

SELECT pg_catalog.setval('public.users_id_seq', 124, true);


--
-- Name: action_text_rich_texts action_text_rich_texts_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.action_text_rich_texts
    ADD CONSTRAINT action_text_rich_texts_pkey PRIMARY KEY (id);


--
-- Name: active_storage_attachments active_storage_attachments_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_attachments
    ADD CONSTRAINT active_storage_attachments_pkey PRIMARY KEY (id);


--
-- Name: active_storage_blobs active_storage_blobs_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_blobs
    ADD CONSTRAINT active_storage_blobs_pkey PRIMARY KEY (id);


--
-- Name: active_storage_variant_records active_storage_variant_records_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_variant_records
    ADD CONSTRAINT active_storage_variant_records_pkey PRIMARY KEY (id);


--
-- Name: ar_internal_metadata ar_internal_metadata_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.ar_internal_metadata
    ADD CONSTRAINT ar_internal_metadata_pkey PRIMARY KEY (key);


--
-- Name: schema_migrations schema_migrations_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.schema_migrations
    ADD CONSTRAINT schema_migrations_pkey PRIMARY KEY (version);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (id);


--
-- Name: index_action_text_rich_texts_uniqueness; Type: INDEX; Schema: public; Owner: lvguanlin
--

CREATE UNIQUE INDEX index_action_text_rich_texts_uniqueness ON public.action_text_rich_texts USING btree (record_type, record_id, name);


--
-- Name: index_active_storage_attachments_on_blob_id; Type: INDEX; Schema: public; Owner: lvguanlin
--

CREATE INDEX index_active_storage_attachments_on_blob_id ON public.active_storage_attachments USING btree (blob_id);


--
-- Name: index_active_storage_attachments_uniqueness; Type: INDEX; Schema: public; Owner: lvguanlin
--

CREATE UNIQUE INDEX index_active_storage_attachments_uniqueness ON public.active_storage_attachments USING btree (record_type, record_id, name, blob_id);


--
-- Name: index_active_storage_blobs_on_key; Type: INDEX; Schema: public; Owner: lvguanlin
--

CREATE UNIQUE INDEX index_active_storage_blobs_on_key ON public.active_storage_blobs USING btree (key);


--
-- Name: index_active_storage_variant_records_uniqueness; Type: INDEX; Schema: public; Owner: lvguanlin
--

CREATE UNIQUE INDEX index_active_storage_variant_records_uniqueness ON public.active_storage_variant_records USING btree (blob_id, variation_digest);


--
-- Name: active_storage_variant_records fk_rails_993965df05; Type: FK CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_variant_records
    ADD CONSTRAINT fk_rails_993965df05 FOREIGN KEY (blob_id) REFERENCES public.active_storage_blobs(id);


--
-- Name: active_storage_attachments fk_rails_c3b3935057; Type: FK CONSTRAINT; Schema: public; Owner: lvguanlin
--

ALTER TABLE ONLY public.active_storage_attachments
    ADD CONSTRAINT fk_rails_c3b3935057 FOREIGN KEY (blob_id) REFERENCES public.active_storage_blobs(id);


--
-- PostgreSQL database dump complete
--

